<template>
  <div class="post" v-for="post in posts" v-bind:key="post.id">
    <div class="post__title">{{ post.title }}</div>
    <div class="post__subtitle">
      {{ post.subtitle }}
    </div>
  </div>
</template>

<script>
export default {
  
  name: "App",
  data() {
    return {
      posts: [
        {
          id: 1,
          title: "1. Устроить кукольный театр или театр теней",

          subtitle: `Соорудить ширму можно при помощи обыкновенного одеяла или простыни. Для кукольного театра подойдут 
           небольшие мягкие игрушки, а для театра теней нужно вырезать силуэты из бумаги. Лампа, помещённая за ширмой, завершит 
            нехитрую конструкцию. Малыши будут в восторге, а взрослые смогут снова окунуться в детство.`,
        },
        {
          id: 2,
          title: "2. Организовать домашний маскарад",

          subtitle: `Карнавальные костюмы пригодятся не только для детских утренников. Раскрасьте лица, 
          наденьте маски, создайте свой образ из подручных материалов... и попробуйте угадать, кто кем нарядился.`,
        },
        {
          id: 3,
          title: "3. Подготовить новогоднее обращение",

          subtitle: `Кто сказал, что новогоднее обращение может быть только у президента?
           Вашим близким тоже наверняка есть что сказать. Пусть каждый из тех, кто с вами рядом, подготовит пятиминутную речь и выступит перед собравшимися.`,
        },
        {
          id: 4,
          title: "4. Погадать на будущий год",

          subtitle: `Способов масса: испечь китайские печенья с предсказаниями, погадать на картах, на кофейной гуще, на воске. 
          Воспринимать знаки судьбы можно и серьёзно, и несерьёзно. Главное — трактовать их в положительном ключе и надеяться на лучшее.`,
        },
        {
          id: 5,
          title: "5. Заложить новогоднюю традицию",

          subtitle: `Герой фильма «Ирония судьбы» каждое 31 декабря ходил с друзьями в баню. Если у вас нет новогодней традиции, самое время 
          её придумать. Вспомните, какие занятия дарили вам радость в детстве, или подсмотрите идеи у других читателей Лайфхакера.`,
        },
      ],

      inputTitle: "",
      inputSubtitle: "",
    };
  },
  methods: {
    onChangeTitle(event) {
      this.inputTitle = event.target.value;
      console.log(event);
    },
    onChangeSubtitle(event) {
      this.inputSubtitle = event.target.value;
      console.log(event);
    },
  },
};
</script>
<style >
  
</style>